StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_vht.c
	rtw_add_ext_cap_info(pmlmepriv->ext_capab_ie_data, &(pmlmepriv->ext_capab_ie_len), OP_MODE_NOTIFICATION);
	rtw_update_ext_cap_ie(pmlmepriv->ext_capab_ie_data, pmlmepriv->ext_capab_ie_len, pnetwork->IEs \
			      , &(pnetwork->IELength), _BEACON_IE_OFFSET_);
}

void rtw_check_vht_ies(_adapter *padapter, WLAN_BSSID_EX *pnetwork)
{
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct vht_priv *pvhtpriv = &(pmlmepriv->vhtpriv);
	u32 ie_len;
	u32 ies_len = pnetwork->IELength - _BEACON_IE_OFFSET_;
	u8 *ies = pnetwork->IEs + _BEACON_IE_OFFSET_;
	u8 *vht_cap_ie, *vht_op_ie;

	vht_cap_ie = rtw_get_ie(ies, EID_VHTCapability, &ie_len, ies_len);
	vht_op_ie = rtw_get_ie(ies, EID_VHTOperation, &ie_len, ies_len);

	rtw_update_drv_vht_cap(padapter, vht_cap_ie);
	rtw_set_vht_ext_cap(padapter, pnetwork);

	/* Backup these two VHT IEs from hostapd/wpa_supplicant for restore usage */
	if (vht_cap_ie != NULL) {
		_rtw_memcpy(pvhtpriv->vht_cap_ie_backup, vht_cap_ie + 2, VHT_CAP_IE_LEN);
	}

	if (vht_op_ie != NULL) {
		_rtw_memcpy(pvhtpriv->vht_op_ie_backup, vht_op_ie + 2, VHT_OP_IE_LEN);
	}

	/* TODO : We don't handle this IE like before, so remove it */
	rtw_remove_bcn_ie(padapter, pnetwork, EID_VHTTransmitPower);
}

void rtw_reattach_vht_ies(_adapter *padapter, WLAN_BSSID_EX *pnetwork)
{
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct vht_priv *pvhtpriv = &(pmlmepriv->vhtpriv);
	u8 *vht_cap_ie = pnetwork->IEs + pnetwork->IELength;
	u8 *vht_op_ie;

	RTW_INFO(FUNC_ADPT_FMT"\n", FUNC_ADPT_ARG(padapter));

	if (pnetwork->IEs != NULL) {
		vht_op_ie = rtw_set_ie(vht_cap_ie, EID_VHTCapability, VHT_CAP_IE_LEN,
				       pvhtpriv->vht_cap_ie_backup, &(pnetwork->IELength));

		rtw_set_ie(vht_op_ie, EID_VHTOperation, VHT_OP_IE_LEN,
			   pvhtpriv->vht_op_ie_backup, &(pnetwork->IELength));

		rtw_set_vht_ext_cap(padapter, pnetwork);
	}

	pmlmepriv->vhtpriv.vht_option = _TRUE;
}
#endif /* CONFIG_AP_MODE */
#endif /* CONFIG_80211AC_VHT */
